
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Роль Из Метаданные.Роли Цикл
		НоваяСтрока = КоллекцияРолей.Добавить();
		НоваяСтрока.Роль = Роль.Имя;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияРолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//ТекущиеДанные = Элемент.ТекущиеДанные;
	//
	//ПолучитьСписокПользователейВыбраннойРолиНаСервере(ТекущиеДанные.Роль);
	
	
КонецПроцедуры

&НаКлиенте
Процедура КоллекцияРолейПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.КоллекцияРолей.ТекущиеДанные;
	ПолучитьСписокПользователейВыбраннойРолиНаСервере(ТекущиеДанные.Роль);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПользователейВыбраннойРолиНаСервере(ИмяРоли)
	
	Для Каждого Роль Из Метаданные.Роли Цикл
		Если Роль.Имя = ИмяРоли Тогда
			ИсследуемаяРоль = Роль;	
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
		
	ТаблицаПользователейРоли = РеквизитФормыВЗначение("ПользователиРоли");
	ТаблицаПользователейРоли.Очистить();
	
	МассивПользователейРоли = Новый Массив;
	
	
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ТекущийПользовательИБ Из МассивПользователейИБ Цикл
		Если ТекущийПользовательИБ.Роли.Содержит(ИсследуемаяРоль) Тогда
			НоваяСтрока = ТаблицаПользователейРоли.Добавить();
			НоваяСтрока.Пользователь = ТекущийПользовательИБ.ПолноеИмя;
		КонецЕсли;	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаПользователейРоли, "ПользователиРоли");
	
КонецПроцедуры


// потом удалить
//
&НаСервере
Процедура ПолучитьСписокПользователейРолиНаСервере()
	
	ИсследуемаяРоль = Метаданные.Роли.РИТ_ДобавлениеИзменениеПодсистемыМаркетнигОграничено;
	
	ТаблицаПользователейРоли = РеквизитФормыВЗначение("ПользователиРоли");
	ТаблицаПользователейРоли.Очистить();
	
	МассивПользователейРоли = Новый Массив;
	
	
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ТекущийПользовательИБ Из МассивПользователейИБ Цикл
		Если ТекущийПользовательИБ.Роли.Содержит(ИсследуемаяРоль) Тогда
			НоваяСтрока = ТаблицаПользователейРоли.Добавить();
			НоваяСтрока.Пользователь = ТекущийПользовательИБ.ПолноеИмя;
		КонецЕсли;	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаПользователейРоли, "ПользователиРоли");
	
КонецПроцедуры

